In [8]:
import numpy as np
import pandas as pd

s1 = pd.Series(np.arange(5.0), index=['a', 'b', 'c', 'd', 'e'])
s1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [9]:
s1['c']

2.0

In [5]:
s1[['a', 'c']]

a    0
c    2
dtype: int64

In [6]:
s1['a':'c']

a    0
b    1
c    2
dtype: int64

In [3]:
s1[s1 == 2.0]

c    2
dtype: int64

In [7]:
s1[s1 > 2.0]

d    3
e    4
dtype: int64

In [17]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
             index = ['台北', '台中', '高雄', '台南'],
             columns = ['a','c','d', 'x'])
data

     a   c   d   x
台北   0   1   2   3
台中   4   5   6   7
高雄   8   9  10  11
台南  12  13  14  15

In [24]:
data[['a', 'c']]

     a   c
台北   0   1
台中   4   5
高雄   8   9
台南  12  13

In [23]:
data.loc[['台北','台中']]

    a  c  d  x
台北  0  1  2  3
台中  4  5  6  7

In [15]:
data[data < 5] = 0.0
data

In [18]:
data[data['x'] < 8]

    a  c  d  x
台北  0  1  2  3
台中  4  5  6  7

In [29]:
data.loc['高雄'] >= 10

a    False
c    False
d     True
x     True
Name: 高雄, dtype: bool

In [30]:
data.T[data.loc['高雄'] >= 10]

   台北  台中  高雄  台南
d   2   6  10  14
x   3   7  11  15

In [31]:
data.T[data.loc['高雄'] >= 10].T

     d   x
台北   2   3
台中   6   7
高雄  10  11
台南  14  15